БИТУправление_медицинским_центром_демо/src/DataProcessors/МассовыеОбзвоны/МассовыеОбзвоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МассовыеОбзвоны</name>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/КомментарииПоЗвонкам/КомментарииПоЗвонкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарииПоЗвонкам</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокирующийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
      <types>DocumentRef.Заявка</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.бит_СписокОбзвона</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВторичныйОбъект</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/DataProcessors/МассовыеОбзвоны/Forms/ФормаРедактированияКомментария/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбранныйОбъект = Параметры.ВыбранныйОбъект;
	ВыбранныйКлиент = Параметры.ВыбранныйКлиент;
	
	Запись = РегистрыСведений.КомментарииПоЗвонкам.СоздатьМенеджерЗаписи();
	Запись.Объект			= ВыбранныйОбъект;
	Запись.ВторичныйОбъект	= ВыбранныйКлиент;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Комментарий = Запись.Комментарий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбновитьКомментарий(ВыбранныйОбъект, ВыбранныйКлиент, Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбновитьКомментарий(ВыбранныйОбъект, ВыбранныйКлиент, Комментарий)
	
	Запись = РегистрыСведений.КомментарииПоЗвонкам.СоздатьМенеджерЗаписи();
	Запись.Объект			= ВыбранныйОбъект;
	Запись.ВторичныйОбъект	= ВыбранныйКлиент;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Комментарий = Комментарий;
		Попытка
			Запись.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
